In [1]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [2]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
new_row = {'Name': 'David', 'Age': 28}

In [8]:
new_df = pd.DataFrame(new_row,index =[0])
new_df

    Name  Age
0  David   28

In [13]:
df = pd.concat([df,new_df],ignore_index = True)

In [14]:
df.to_csv("tempo.csv")

In [15]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [18]:
list(df["Name"])

['Alice', 'Bob', 'Charlie', 'David']